app/Controllers/Libros.php

    public function index(){

        $libro = new Libro();
        $datos['libros'] = $libro->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `libros`
ORDER BY `id` ASC